//COMPMAPS JOB (1),CLASS=A,MSGCLASS=H,MSGLEVEL=(1,1),
//             NOTIFY=&SYSUID
//*
//IBMLIB  JCLLIB ORDER=DFH610.CICS.SDFHPROC
//*
//CPLSTP  EXEC DFHMAPS,
//             MAPLIB='KC03C91.LOAD',
//             INDEX='DFH610.CICS',
//             DSCTLIB='KC03C91.COBOL.COPYLIB',
//             MAPNAME='TESTC'
//SYSUT1 DD DSN=KC03C91.BMS.SOURCE(TESTC),DISP=SHR
