//DELVSAM  JOB  (ACCT),'DEL VSAM',CLASS=A,MSGCLASS=A,MSGLEVEL=(1,1)
//STEP1    EXEC PGM=IDCAMS
//SYSPRINT DD  SYSOUT=*
//SYSIN    DD  *
  DELETE KC03CA5.VSAM.USUARIOS -
         CLUSTER -
         PURGE
  SET MAXCC = 0
/*
