//SRHVSAM JOB CLASS=A,MSGCLASS=A
//STEP1   EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=*
//SYSIN    DD *
  LISTCAT ENT(KC03CA5.VSAM.USUARIOS) ALL
/*
//
