       01  CMENUI.
           02  FILLER PIC X(12).
           02  OPCIONL    COMP  PIC  S9(4).
           02  OPCIONF    PICTURE X.
           02  FILLER REDEFINES OPCIONF.
             03 OPCIONA    PICTURE X.
           02  OPCIONI  PIC X(1).
           02  MENSAJE1L    COMP  PIC  S9(4).
           02  MENSAJE1F    PICTURE X.
           02  FILLER REDEFINES MENSAJE1F.
             03 MENSAJE1A    PICTURE X.
           02  MENSAJE1I  PIC X(60).
           02  MENSAJE2L    COMP  PIC  S9(4).
           02  MENSAJE2F    PICTURE X.
           02  FILLER REDEFINES MENSAJE2F.
             03 MENSAJE2A    PICTURE X.
           02  MENSAJE2I  PIC X(60).
           02  MENSAJE3L    COMP  PIC  S9(4).
           02  MENSAJE3F    PICTURE X.
           02  FILLER REDEFINES MENSAJE3F.
             03 MENSAJE3A    PICTURE X.
           02  MENSAJE3I  PIC X(60).
           02  MENSAJE4L    COMP  PIC  S9(4).
           02  MENSAJE4F    PICTURE X.
           02  FILLER REDEFINES MENSAJE4F.
             03 MENSAJE4A    PICTURE X.
           02  MENSAJE4I  PIC X(60).
           02  MENSAJE5L    COMP  PIC  S9(4).
           02  MENSAJE5F    PICTURE X.
           02  FILLER REDEFINES MENSAJE5F.
             03 MENSAJE5A    PICTURE X.
           02  MENSAJE5I  PIC X(60).
           02  MENSAJE6L    COMP  PIC  S9(4).
           02  MENSAJE6F    PICTURE X.
           02  FILLER REDEFINES MENSAJE6F.
             03 MENSAJE6A    PICTURE X.
           02  MENSAJE6I  PIC X(60).
           02  MENSAJE7L    COMP  PIC  S9(4).
           02  MENSAJE7F    PICTURE X.
           02  FILLER REDEFINES MENSAJE7F.
             03 MENSAJE7A    PICTURE X.
           02  MENSAJE7I  PIC X(60).
           02  MENSAJE8L    COMP  PIC  S9(4).
           02  MENSAJE8F    PICTURE X.
           02  FILLER REDEFINES MENSAJE8F.
             03 MENSAJE8A    PICTURE X.
           02  MENSAJE8I  PIC X(60).
           02  MENSAJE9L    COMP  PIC  S9(4).
           02  MENSAJE9F    PICTURE X.
           02  FILLER REDEFINES MENSAJE9F.
             03 MENSAJE9A    PICTURE X.
           02  MENSAJE9I  PIC X(60).
           02  MENSAJE10L    COMP  PIC  S9(4).
           02  MENSAJE10F    PICTURE X.
           02  FILLER REDEFINES MENSAJE10F.
             03 MENSAJE10A    PICTURE X.
           02  MENSAJE10I  PIC X(60).
       01  CMENUO REDEFINES CMENUI.
           02  FILLER PIC X(12).
           02  FILLER PICTURE X(3).
           02  OPCIONO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  MENSAJE1O  PIC X(60).
           02  FILLER PICTURE X(3).
           02  MENSAJE2O  PIC X(60).
           02  FILLER PICTURE X(3).
           02  MENSAJE3O  PIC X(60).
           02  FILLER PICTURE X(3).
           02  MENSAJE4O  PIC X(60).
           02  FILLER PICTURE X(3).
           02  MENSAJE5O  PIC X(60).
           02  FILLER PICTURE X(3).
           02  MENSAJE6O  PIC X(60).
           02  FILLER PICTURE X(3).
           02  MENSAJE7O  PIC X(60).
           02  FILLER PICTURE X(3).
           02  MENSAJE8O  PIC X(60).
           02  FILLER PICTURE X(3).
           02  MENSAJE9O  PIC X(60).
           02  FILLER PICTURE X(3).
           02  MENSAJE10O  PIC X(60).
